In [1]:
import pandas as pd
import numpy as np

In [2]:
input_file = 'http://bit.ly/36gJKAM'
dataSet  = pd.read_csv(input_file, header=None, 
                    names = ['C1', 'C2', 'C3', 'C4']); dataSet

     C1    C2    C3    C4
0  11.0  12.0  13.0  14.0
1   NaN  22.0   NaN  24.0
2   NaN   NaN  33.0   NaN
3  41.0  42.0  43.0   NaN
4   NaN  52.0   NaN  54.0
5  61.0  62.0  63.0   NaN
6   NaN  72.0  73.0  74.0
7  81.0  82.0  83.0  84.0

In [3]:
dataSet.isnull().sum(axis = 0)

C1    4
C2    1
C3    2
C4    3
dtype: int64

In [4]:
dataSet.isnull().sum(axis = 0) / dataSet.shape[0]

C1    0.500
C2    0.125
C3    0.250
C4    0.375
dtype: float64

In [5]:
dataSet2 = dataSet.drop('C1', axis=1)

In [6]:
dataSet2.shape

(8, 3)

In [7]:
dataSet2.isnull().sum(axis = 1)

0    0
1    1
2    2
3    1
4    1
5    1
6    0
7    0
dtype: int64

In [8]:
dataSet3 = dataSet2.drop(2, axis=0)

In [14]:
dataSet4 = dataSet3.copy(); dataSet4

     C2    C3    C4
0  12.0  13.0  14.0
1  22.0   NaN  24.0
3  42.0  43.0   NaN
4  52.0   NaN  54.0
5  62.0  63.0   NaN
6  72.0  73.0  74.0
7  82.0  83.0  84.0

In [16]:
dataSet4.C3.interpolate (inplace=True); dataSet4.C3

0    13.0
1    28.0
3    43.0
4    53.0
5    63.0
6    73.0
7    83.0
Name: C3, dtype: float64

In [15]:
dataSet4.C4.interpolate (method='nearest', inplace=True); dataSet4.C4

0    14.0
1    24.0
3    54.0
4    54.0
5    54.0
6    74.0
7    84.0
Name: C4, dtype: float64

In [17]:
dataSet5 = dataSet3.copy()
dataSet5.C3.fillna(dataSet5.C3.mean(), inplace=True)
dataSet5

     C2    C3    C4
0  12.0  13.0  14.0
1  22.0  55.0  24.0
3  42.0  43.0   NaN
4  52.0  55.0  54.0
5  62.0  63.0   NaN
6  72.0  73.0  74.0
7  82.0  83.0  84.0

In [18]:
dataSet5.index = range(dataSet5.shape[0])

In [23]:
print (dataSet5.iloc[2])
print ('...................')
print (dataSet5.iloc[2].mean())

C2    42.0
C3    43.0
C4    42.5
Name: 2, dtype: float64
...................
42.5

In [21]:
dataSet5.iloc[2].fillna(dataSet5.iloc[2].mean(), inplace=True); dataSet5

     C2    C3    C4
0  12.0  13.0  14.0
1  22.0  55.0  24.0
2  42.0  43.0  42.5
3  52.0  55.0  54.0
4  62.0  63.0   NaN
5  72.0  73.0  74.0
6  82.0  83.0  84.0

In [24]:
df_map = dataSet5.copy()
df_map.C2  = df_map.C2.map(
	lambda c: 'strong' if c > 60 else 'medium' if c > 40 else 'weak')

In [26]:
from sklearn.preprocessing import LabelEncoder
df_lbl_enc = df_map.copy()
df_lbl_enc.C2 = LabelEncoder().fit_transform ( df_lbl_enc.C2 ); df_lbl_enc

   C2    C3    C4
0   2  13.0  14.0
1   2  55.0  24.0
2   0  43.0  42.5
3   0  55.0  54.0
4   1  63.0   NaN
5   1  73.0  74.0
6   1  83.0  84.0

In [27]:
map_dic = {'weak': 0, 'medium': 1, 'strong':2}
# This will create the "mapping"
# Use the above mapping in the map function:
df_map.copy()['C2'].map(map_dic)

0    0
1    0
2    1
3    1
4    2
5    2
6    2
Name: C2, dtype: int64

In [28]:
from sklearn import preprocessing

In [29]:
dataSet5_scaled = preprocessing.scale(dataSet5); dataSet5_scaled

array([[-1.56501609, -2.00227144, -1.38688302],
       [-1.1436656 ,  0.        , -0.98777999],
       [-0.30096463, -0.57207755, -0.24943939],
       [ 0.12038585,  0.        ,  0.20952909],
       [ 0.54173634,  0.38138504,         nan],
       [ 0.96308682,  0.85811633,  1.00773514],
       [ 1.38443731,  1.33484762,  1.40683817]])

In [30]:
df = pd.DataFrame (dataSet5_scaled, columns=['C1', 'C2', 'C3'])

In [31]:
df.std()
df.mean()

C1   -2.220446e-16
C2    3.172066e-17
C3    3.700743e-17
dtype: float64

In [32]:
df.describe()

                 C1            C2            C3
count  7.000000e+00  7.000000e+00  6.000000e+00
mean  -2.220446e-16  3.172066e-17  3.700743e-17
std    1.080123e+00  1.080123e+00  1.095445e+00
min   -1.565016e+00 -2.002271e+00 -1.386883e+00
25%   -7.223151e-01 -2.860388e-01 -8.031948e-01
50%    1.203859e-01  0.000000e+00 -1.995515e-02
75%    7.524116e-01  6.197507e-01  8.081836e-01
max    1.384437e+00  1.334848e+00  1.406838e+00

In [34]:
preprocessing.MinMaxScaler().fit_transform(dataSet5)

array([[0.        , 0.        , 0.        ],
       [0.14285714, 0.6       , 0.14285714],
       [0.42857143, 0.42857143, 0.40714286],
       [0.57142857, 0.6       , 0.57142857],
       [0.71428571, 0.71428571,        nan],
       [0.85714286, 0.85714286, 0.85714286],
       [1.        , 1.        , 1.        ]])

In [35]:
np.random.seed(1234)
toScaleDS = np.ceil(100 * np.random.rand (10,3))
toScaleDS

array([[20., 63., 44.],
       [79., 78., 28.],
       [28., 81., 96.],
       [88., 36., 51.],
       [69., 72., 38.],
       [57., 51.,  2.],
       [78., 89., 37.],
       [62.,  8., 37.],
       [94., 66., 40.],
       [79., 32., 57.]])

In [36]:
# Get the average of the values in the second column:
toScaleDS[:,1].mean()

57.6

In [37]:
# Get the standard deviation across the third row:
toScaleDS[2,:].std()

29.169999809545573

In [38]:
# Enter the following command to apply z-score normalization transformation:
from sklearn import preprocessing
scaledDS = preprocessing.scale(toScaleDS)
scaledDS

array([[-1.95146565,  0.22264681,  0.04435909],
       [ 0.58458002,  0.84111018, -0.66538641],
       [-1.60759505,  0.96480286,  2.35103199],
       [ 0.97143444, -0.89058725,  0.35487275],
       [ 0.15474177,  0.59372484, -0.22179547],
       [-0.36106413, -0.27212388, -1.81872286],
       [ 0.54159619,  1.29464999, -0.26615457],
       [-0.146145  , -2.04505221, -0.26615457],
       [ 1.22933739,  0.34633949, -0.13307728],
       [ 0.58458002, -1.05551082,  0.62102732]])

In [39]:
np.mean(scaledDS, axis = 0)

array([-2.22044605e-16, -6.66133815e-17,  1.11022302e-17])

In [40]:
np.std(scaledDS, axis = 0)

array([1., 1., 1.])

In [41]:
mmScaler = preprocessing.MinMaxScaler()
mmScaler.fit_transform(toScaleDS)

array([[0.        , 0.67901235, 0.44680851],
       [0.7972973 , 0.86419753, 0.27659574],
       [0.10810811, 0.90123457, 1.        ],
       [0.91891892, 0.34567901, 0.5212766 ],
       [0.66216216, 0.79012346, 0.38297872],
       [0.5       , 0.5308642 , 0.        ],
       [0.78378378, 1.        , 0.37234043],
       [0.56756757, 0.        , 0.37234043],
       [1.        , 0.71604938, 0.40425532],
       [0.7972973 , 0.2962963 , 0.58510638]])